import matplotlib.pyplot as plt
import numpy as np

N_points = 100000
n_bins = 20

# Generate a normal distribution, center at x=0 and y=5
x = np.random.randn(N_points)
y = .4 * x + np.random.randn(100000) + 5

fig, axs = plt.subplots(1, 2, sharey=True, tight_layout=True)

# We can set the number of bins with the `bins` kwarg
axs[0].hist(x, bins=n_bins)
axs[1].hist(y, bins=n_bins)

ของ, ทำเนียบขาว, ห้อง, ทำ, งาน, รูป, ไข่, มี, ลักษณะ, เป็น, รูป, วงรี, มี, ขนาด, ด้าน, ยาว, 35, ฟุต, 10, นิ้ว
152042, 152042, ท่าอากาศยานสุโขทัย, ท่าอากาศยานสุโขทัย, ท่าอากาศยานสุโขทัย, หรือ, สนามบินสุโขทัย, เปิด, ทำ, การ, บิน, เมื่อ, วัน, ที่, 12, เมษายน, พศ, 2539
, ท่าอากาศยานสุโขทัย, มี

154178, 154178, วนิดา, ตันติวิทยาพิทักษ์, วนิดาตันติวิทยาพิทักษ์วนิดา, ตันติวิทยาพิทักษ์, หรือ, มด, เกิด, ใน, ครอบครัว, ชาว, ไทย, เชื้อสาย, จีน, ที่, บาง, 
รัก, เมื่อ, วัน

169077, 169077, ปีเตอร์แจ็กสัน, ปีเตอร์แจ็กสัน, เซอร์ปีเตอร์, โรเบิร์ตแจ็กสัน, เป็น, ชาว, นิวซีแลนด์, เกิด, เมื่อ, วัน, ที่, 31, ตุลาคม, พศ, 2504, ใน, เข
ต, เมือง

มะม่วง, มะม่วง, เป็น, ไม้, ยืนต้น, ใน, สกุล, ซึ่ง, เป็น, ไม้, ผล, เมือง, ร้อน, ใน, วงศ์, กลุ่ม, เดียว, กับ, ถั่ว, พิสตาชีโอ

83670, 83670, อุทยานแห่งชาติสิรินาถ, อุทยานแห่งชาติสิรินาถ, อุทยานแห่งชาติสิรินาถ, เป็น, อุทยาน, แห่งชาติ, ที่, ตั้ง, อยู่, ใน, จังหวัดภูเก็ต, ประวัติ, ประวัติ,
 อุทยานแห่งชาติสิรินาถ, มี, พื้นที่, ครอบคลุม, อยู่

<PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, <PAD>, เป็น, บริษัท, ใหญ่, อันดับ9ของโลก